; domain
(define (domain waiter)
    (:requirements :typing :negative-preconditions)
    (:types
        location patient time - object
    )

    (:predicates
        (current-time ?curr_time - time)
        (next-time ?curr_time - time ?next_time - time)
        (robot-at ?loc - location)
        (maybe-patient-at ?patient - patient ?loc - location)
        (announced-patient-at ?patient - patient ?loc - location)
        (call-reservation ?patient - patient ?start_time - time ?end_time - time)
        (search-time ?patient - patient ?time - time)
        (searching ?patient)
        (occupied)
        (call-ended)
        (call-cancelled ?patient - patient ?time - time)
        (can-call ?patient)
        (calling ?patient - patient ?end_time - time)
        (completed ?patient - patient)
    )

    (:action pass-time
        :parameters (?curr_time ?next_time - time)
        :precondition (and 
            (current-time ?curr_time)
            (next-time ?curr_time ?next_time)
            (not (call-ended))
        )
        :effect (and 
            (not (current-time ?curr_time))
            (current-time ?next_time)
        )
    )

    (:action search-patient
        :parameters (?patient - patient ?curr_time - time)
        :precondition (and 
            (current-time ?curr_time)
            (search-time ?patient ?curr_time)
            (not (occupied))
        )
        :effect (and 
            (searching ?patient)
            (not (search-time ?patient ?curr_time))
            (occupied)
        )
    )

    (:action go-to-place
        :parameters (?patient - patient ?loc_i ?loc_f - location)
        :precondition 
            (and
                (robot-at ?loc_i)
                (searching ?patient)
            )
        :effect 
            (and
                (robot-at ?loc_f)
                (not (robot-at ?loc_i))
            )
    )

    (:action announce-patient
        :parameters (?patient - patient ?loc - location ?curr_time ?next_time - time)
        :precondition (and
            (current-time ?curr_time)
            (next-time ?curr_time ?next_time)
            (robot-at ?loc)
            (maybe-patient-at ?patient ?loc)
            (searching ?patient)
        )
        :effect (and 
            (not (current-time ?curr_time))
            (current-time ?next_time)
            (not (maybe-patient-at ?patient ?loc))
            (announced-patient-at ?patient ?loc)
        )
    )
    
    (:action greet-patient
        :parameters (?patient - patient ?start_time ?end_time - time)
        :precondition (and 
            (current-time ?start_time)
            (robot-at video-room)
            (searching ?patient)
            (call-reservation ?patient ?start_time ?end_time)
        )
        :effect (and 
            (not (searching ?patient))
            (can-call ?patient)
        )
    )
    

    (:action call-family
        :parameters (?patient - patient ?start_time ?end_time - time)
        :precondition (and
            (current-time ?start_time)
            (robot-at video-room)
            (can-call ?patient)
            (call-reservation ?patient ?start_time ?end_time)
        )
        :effect (and 
            (not (can-call ?patient))
            (calling ?patient ?end_time)
            (not (call-reservation ?patient ?start_time ?end_time))
        )
    )


    (:action end-call
        :parameters (?patient - patient ?curr_time - time)
        :precondition (and 
            (current-time ?curr_time)
            (robot-at video-room)
            (calling ?patient ?curr_time)
        )
        :effect (and 
            (not (calling ?patient ?curr_time))
            (completed ?patient)
            (call-ended)
        )
    )
    
    
    (:action return-to-base
        :parameters (?patient - patient ?curr_time - time)
        :precondition (and 
            (current-time ?curr_time)
            (robot-at video-room)
            (call-ended)
            (not (search-time ?patient ?curr_time))
            (occupied)
        )
        :effect (and 
            (not (call-ended))
            (not (robot-at video-room))
            (robot-at charging-base)
            (not (occupied))
        )
    )

    (:action next-patient
        :parameters (?patient - patient ?curr_time - time)
        :precondition (and 
            (current-time ?curr_time)
            (robot-at video-room)
            (call-ended)
            (occupied)
            (search-time ?patient ?curr_time)
        )
        :effect (and 
            (not (call-ended))
            (not (occupied))
        )
    )
    
)

; problem
(define (problem prob1)
    (:domain waiter)
    (:objects
        charging-base video-room room1 room2 room3 room4 room5 - location
        p1 p2 p3 p4 - patient
        t01 t02 t03 t04 t05 t06 t07 t08 t09 t10 t11 t12 t13 t14 t15 - time
        t16 t17 t18 t19 t20 t21 t22 t23 t24 t25 t26 t27 t28 t29 t30 - time
        t31 t32 t33 t34 t35 t36 t37 t38 t39 t40 t41 t42 t43 t44 t45 - time
    )
    (:init
        (current-time t01)

        (robot-at charging-base)

        (maybe-patient-at p1 room1)
        (maybe-patient-at p1 room2)

        (maybe-patient-at p2 room2)
        (maybe-patient-at p2 room3)
        (maybe-patient-at p2 room4)

        (maybe-patient-at p3 room3)
        
        (maybe-patient-at p4 room1)
        (maybe-patient-at p4 room3)
        (maybe-patient-at p4 room4)
        (maybe-patient-at p4 room5)

        (search-time p1 t05)
        (call-reservation p1 t07 t10)
        ;(call-cancelled p1 t06)

        (search-time p2 t13)
        (call-reservation p2 t16 t20)
        ;(call-cancelled p2 t16)

        (search-time p3 t29)
        (call-reservation p3 t30 t35)

        (search-time p4 t35)
        (call-reservation p4 t39 t42)
        
        (next-time t01 t02) (next-time t02 t03) (next-time t03 t04) (next-time t04 t05) 
        (next-time t05 t06) (next-time t06 t07) (next-time t07 t08) (next-time t08 t09) 
        (next-time t09 t10) (next-time t10 t11) (next-time t11 t12) (next-time t12 t13) 
        (next-time t13 t14) (next-time t14 t15) (next-time t15 t16) (next-time t16 t17) 
        (next-time t17 t18) (next-time t18 t19) (next-time t19 t20) (next-time t20 t21) 
        (next-time t21 t22) (next-time t22 t23) (next-time t23 t24) (next-time t24 t25) 
        (next-time t25 t26) (next-time t26 t27) (next-time t27 t28) (next-time t28 t29) 
        (next-time t29 t30) (next-time t30 t31) (next-time t31 t32) (next-time t32 t33) 
        (next-time t33 t34) (next-time t34 t35) (next-time t35 t36) (next-time t36 t37) 
        (next-time t37 t38) (next-time t38 t39) (next-time t39 t40) (next-time t40 t41) 
        (next-time t41 t42) (next-time t42 t43) (next-time t43 t44) (next-time t44 t45) 
    )
    (:goal 
        (and
            (completed p1)
            (completed p2)
            (completed p3)
            (completed p4)

            (announced-patient-at p1 room1)
            (announced-patient-at p1 room2)

            (announced-patient-at p2 room2)
            (announced-patient-at p2 room3)
            (announced-patient-at p2 room4)

            (announced-patient-at p3 room3)
            
            (announced-patient-at p4 room1)
            (announced-patient-at p4 room3)
            (announced-patient-at p4 room4)
            (announced-patient-at p4 room5)
        )
    )
)

; plan
1. (pass-time t01 t02)
   deleted: (current-time t01)
   added: (current-time t02)
   goals met: 0 of 14
2. (pass-time t02 t03)
   deleted: (current-time t02)
   added: (current-time t03)
   goals met: 0 of 14
3. (pass-time t03 t04)
   deleted: (current-time t03)
   added: (current-time t04)
   goals met: 0 of 14
4. (pass-time t04 t05)
   deleted: (current-time t04)
   added: (current-time t05)
   goals met: 0 of 14
5. (search-patient p1 t05)
   deleted: (search-time p1 t05)
   added: (searching p1) (occupied)
   goals met: 0 of 14
6. (go-to-place p1 charging-base room1)
   deleted: (robot-at charging-base)
   added: (robot-at room1)
   goals met: 0 of 14
7. (announce-patient p1 room1 t05 t06)
   deleted: (current-time t05) (maybe-patient-at p1 room1)
   added: (current-time t06) (announced-patient-at p1 room1)
   goals met: 1 of 14
8. (go-to-place p1 room1 room2)
   deleted: (robot-at room1)
   added: (robot-at room2)
   goals met: 1 of 14
9. (announce-patient p1 room2 t06 t07)
   deleted: (current-time t06) (maybe-patient-at p1 room2)
   added: (current-time t07) (announced-patient-at p1 room2)
   goals met: 2 of 14
10. (go-to-place p1 room2 video-room)
   deleted: (robot-at room2)
   added: (robot-at video-room)
   goals met: 2 of 14
11. (greet-patient p1 t07 t10)
   deleted: (searching p1)
   added: (can-call p1)
   goals met: 2 of 14
12. (call-family p1 t07 t10)
   deleted: (can-call p1) (call-reservation p1 t07 t10)
   added: (calling p1 t10)
   goals met: 2 of 14
13. (pass-time t07 t08)
   deleted: (current-time t07)
   added: (current-time t08)
   goals met: 2 of 14
14. (pass-time t08 t09)
   deleted: (current-time t08)
   added: (current-time t09)
   goals met: 2 of 14
15. (pass-time t09 t10)
   deleted: (current-time t09)
   added: (current-time t10)
   goals met: 2 of 14
16. (end-call p1 t10)
   deleted: (calling p1 t10)
   added: (completed p1) (call-ended)
   goals met: 3 of 14
17. (return-to-base p1 t10)
   deleted: (call-ended) (robot-at video-room) (occupied)
   added: (robot-at charging-base)
   goals met: 3 of 14
18. (pass-time t10 t11)
   deleted: (current-time t10)
   added: (current-time t11)
   goals met: 3 of 14
19. (pass-time t11 t12)
   deleted: (current-time t11)
   added: (current-time t12)
   goals met: 3 of 14
20. (pass-time t12 t13)
   deleted: (current-time t12)
   added: (current-time t13)
   goals met: 3 of 14
21. (search-patient p2 t13)
   deleted: (search-time p2 t13)
   added: (searching p2) (occupied)
   goals met: 3 of 14
22. (go-to-place p2 charging-base room2)
   deleted: (robot-at charging-base)
   added: (robot-at room2)
   goals met: 3 of 14
23. (announce-patient p2 room2 t13 t14)
   deleted: (current-time t13) (maybe-patient-at p2 room2)
   added: (current-time t14) (announced-patient-at p2 room2)
   goals met: 4 of 14
24. (go-to-place p2 room2 room3)
   deleted: (robot-at room2)
   added: (robot-at room3)
   goals met: 4 of 14
25. (announce-patient p2 room3 t14 t15)
   deleted: (current-time t14) (maybe-patient-at p2 room3)
   added: (current-time t15) (announced-patient-at p2 room3)
   goals met: 5 of 14
26. (go-to-place p2 room3 room4)
   deleted: (robot-at room3)
   added: (robot-at room4)
   goals met: 5 of 14
27. (announce-patient p2 room4 t15 t16)
   deleted: (current-time t15) (maybe-patient-at p2 room4)
   added: (current-time t16) (announced-patient-at p2 room4)
   goals met: 6 of 14
28. (go-to-place p2 room4 video-room)
   deleted: (robot-at room4)
   added: (robot-at video-room)
   goals met: 6 of 14
29. (greet-patient p2 t16 t20)
   deleted: (searching p2)
   added: (can-call p2)
   goals met: 6 of 14
30. (call-family p2 t16 t20)
   deleted: (can-call p2) (call-reservation p2 t16 t20)
   added: (calling p2 t20)
   goals met: 6 of 14
31. (pass-time t16 t17)
   deleted: (current-time t16)
   added: (current-time t17)
   goals met: 6 of 14
32. (pass-time t17 t18)
   deleted: (current-time t17)
   added: (current-time t18)
   goals met: 6 of 14
33. (pass-time t18 t19)
   deleted: (current-time t18)
   added: (current-time t19)
   goals met: 6 of 14
34. (pass-time t19 t20)
   deleted: (current-time t19)
   added: (current-time t20)
   goals met: 6 of 14
35. (end-call p2 t20)
   deleted: (calling p2 t20)
   added: (completed p2) (call-ended)
   goals met: 7 of 14
36. (return-to-base p1 t20)
   deleted: (call-ended) (robot-at video-room) (occupied)
   added: (robot-at charging-base)
   goals met: 7 of 14
37. (pass-time t20 t21)
   deleted: (current-time t20)
   added: (current-time t21)
   goals met: 7 of 14
38. (pass-time t21 t22)
   deleted: (current-time t21)
   added: (current-time t22)
   goals met: 7 of 14
39. (pass-time t22 t23)
   deleted: (current-time t22)
   added: (current-time t23)
   goals met: 7 of 14
40. (pass-time t23 t24)
   deleted: (current-time t23)
   added: (current-time t24)
   goals met: 7 of 14
41. (pass-time t24 t25)
   deleted: (current-time t24)
   added: (current-time t25)
   goals met: 7 of 14
42. (pass-time t25 t26)
   deleted: (current-time t25)
   added: (current-time t26)
   goals met: 7 of 14
43. (pass-time t26 t27)
   deleted: (current-time t26)
   added: (current-time t27)
   goals met: 7 of 14
44. (pass-time t27 t28)
   deleted: (current-time t27)
   added: (current-time t28)
   goals met: 7 of 14
45. (pass-time t28 t29)
   deleted: (current-time t28)
   added: (current-time t29)
   goals met: 7 of 14
46. (search-patient p3 t29)
   deleted: (search-time p3 t29)
   added: (searching p3) (occupied)
   goals met: 7 of 14
47. (go-to-place p3 charging-base room3)
   deleted: (robot-at charging-base)
   added: (robot-at room3)
   goals met: 7 of 14
48. (announce-patient p3 room3 t29 t30)
   deleted: (current-time t29) (maybe-patient-at p3 room3)
   added: (current-time t30) (announced-patient-at p3 room3)
   goals met: 8 of 14
49. (go-to-place p3 room3 video-room)
   deleted: (robot-at room3)
   added: (robot-at video-room)
   goals met: 8 of 14
50. (greet-patient p3 t30 t35)
   deleted: (searching p3)
   added: (can-call p3)
   goals met: 8 of 14
51. (call-family p3 t30 t35)
   deleted: (can-call p3) (call-reservation p3 t30 t35)
   added: (calling p3 t35)
   goals met: 8 of 14
52. (pass-time t30 t31)
   deleted: (current-time t30)
   added: (current-time t31)
   goals met: 8 of 14
53. (pass-time t31 t32)
   deleted: (current-time t31)
   added: (current-time t32)
   goals met: 8 of 14
54. (pass-time t32 t33)
   deleted: (current-time t32)
   added: (current-time t33)
   goals met: 8 of 14
55. (pass-time t33 t34)
   deleted: (current-time t33)
   added: (current-time t34)
   goals met: 8 of 14
56. (pass-time t34 t35)
   deleted: (current-time t34)
   added: (current-time t35)
   goals met: 8 of 14
57. (end-call p3 t35)
   deleted: (calling p3 t35)
   added: (completed p3) (call-ended)
   goals met: 9 of 14
58. (next-patient p4 t35)
   deleted: (call-ended) (occupied)
   goals met: 9 of 14
59. (search-patient p4 t35)
   deleted: (search-time p4 t35)
   added: (searching p4) (occupied)
   goals met: 9 of 14
60. (go-to-place p4 video-room room1)
   deleted: (robot-at video-room)
   added: (robot-at room1)
   goals met: 9 of 14
61. (announce-patient p4 room1 t35 t36)
   deleted: (current-time t35) (maybe-patient-at p4 room1)
   added: (current-time t36) (announced-patient-at p4 room1)
   goals met: 10 of 14
62. (go-to-place p4 room1 room3)
   deleted: (robot-at room1)
   added: (robot-at room3)
   goals met: 10 of 14
63. (announce-patient p4 room3 t36 t37)
   deleted: (current-time t36) (maybe-patient-at p4 room3)
   added: (current-time t37) (announced-patient-at p4 room3)
   goals met: 11 of 14
64. (go-to-place p4 room3 room4)
   deleted: (robot-at room3)
   added: (robot-at room4)
   goals met: 11 of 14
65. (announce-patient p4 room4 t37 t38)
   deleted: (current-time t37) (maybe-patient-at p4 room4)
   added: (current-time t38) (announced-patient-at p4 room4)
   goals met: 12 of 14
66. (go-to-place p4 room4 room5)
   deleted: (robot-at room4)
   added: (robot-at room5)
   goals met: 12 of 14
67. (announce-patient p4 room5 t38 t39)
   deleted: (current-time t38) (maybe-patient-at p4 room5)
   added: (current-time t39) (announced-patient-at p4 room5)
   goals met: 13 of 14
68. (go-to-place p4 room5 video-room)
   deleted: (robot-at room5)
   added: (robot-at video-room)
   goals met: 13 of 14
69. (greet-patient p4 t39 t42)
   deleted: (searching p4)
   added: (can-call p4)
   goals met: 13 of 14
70. (call-family p4 t39 t42)
   deleted: (can-call p4) (call-reservation p4 t39 t42)
   added: (calling p4 t42)
   goals met: 13 of 14
71. (pass-time t39 t40)
   deleted: (current-time t39)
   added: (current-time t40)
   goals met: 13 of 14
72. (pass-time t40 t41)
   deleted: (current-time t40)
   added: (current-time t41)
   goals met: 13 of 14
73. (pass-time t41 t42)
   deleted: (current-time t41)
   added: (current-time t42)
   goals met: 13 of 14
74. (end-call p4 t42)
   deleted: (calling p4 t42)
   added: (completed p4) (call-ended)
   goals met: 14 of 14
